<a href="https://colab.research.google.com/github/shivamkrathghara/first/blob/main/anova1_way_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np

In [10]:
from scipy import stats
import scipy
import math
import statsmodels.api as sm
from  statsmodels.formula.api import ols
import pandas as pd

In [33]:
df={'tm1':[4,3,2],
'tm2':[2,4,6],
'tm3':[2,1,3]
}

In [34]:
data=pd.DataFrame(data=df,columns=['tm1','tm2','tm3'])

In [66]:
data

   tm1  tm2  tm3
0    4    2    2
1    3    4    1
2    2    6    3

In [67]:
data_new=pd.melt(data.reset_index(),id_vars=['index'],value_vars=['tm1','tm2','tm3'])
data_new.columns=['Index','Treatments','Values']

In [68]:
data_new

   Index Treatments  Values
0      0        tm1       4
1      1        tm1       3
2      2        tm1       2
3      0        tm2       2
4      1        tm2       4
5      2        tm2       6
6      0        tm3       2
7      1        tm3       1
8      2        tm3       3

In [70]:
model=ols('Values~Treatments',data=data_new)
fittedmodel=model.fit()
anova_table=sm.stats.anova_lm(fittedmodel)
anova_table

             df  sum_sq  mean_sq    F    PR(>F)
Treatments  2.0     6.0      3.0  1.5  0.296296
Residual    6.0    12.0      2.0  NaN       NaN